# Aula 04 - Usando *Pandas*

Aula 04 e 05.

Lendo vários arquivo `.xlsx` (Excel) e manipulando com mais funções em python com `pandas`.

In [1]:
# Importando a biblioteca
import pandas as pd

In [2]:
# Leitura dos arquivos
path = './../datasets/'
df1 = pd.read_excel(path + "Aracaju.xlsx")
df2 = pd.read_excel(path + "Fortaleza.xlsx")
df3 = pd.read_excel(path + "Natal.xlsx")
df4 = pd.read_excel(path + "Recife.xlsx")
df5 = pd.read_excel(path + "Salvador.xlsx")

In [3]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [4]:
# Juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [5]:
# Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [6]:
# Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [7]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
1       Recife 2019-01-01   11.44     983     1
87       Natal 2019-01-02  135.19    1034     2
3    Fortaleza 2019-02-10   20.95    1004     6
12      Recife 2019-01-01   17.48     982     2
121  Fortaleza 2019-03-02   41.55     981     3

In [8]:
# Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [9]:
# Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [10]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [11]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [12]:
# Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [13]:
# Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [14]:
df["Vendas"].mean()

122.61180089485458

In [15]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [16]:
df.sample(10)

        Cidade       Data  Vendas LojaID  Qtde
137      Natal 2019-01-02   51.66   1036     3
73      Recife 2019-01-01   39.71    981     5
101   Salvador 2019-01-01   32.28   1035     3
43      Recife 2019-01-01   22.29    983     7
236   Salvador 2019-01-03  126.29   1035     3
91   Fortaleza 2019-01-01   37.49   1002     1
192   Salvador 2019-01-02  166.51   1036     1
82       Natal 2019-03-07  868.00    854     3
64       Natal 2019-02-22  704.00    853     4
1       Recife 2019-01-01   11.44    983     1

In [17]:
# Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [18]:
# Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [19]:
# Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [20]:
# Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [21]:
# Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [22]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [23]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [24]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [25]:
# Retornando a maior receita
df["Receita"].max()

3544.0

In [26]:
# Retornando a menor receita
df["Receita"].min()

3.34

In [27]:
# nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [28]:
# nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [29]:
# Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [30]:
# Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

#**Trabalhando com datas**

In [31]:
# Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

<ipython-input-31-20456886e21b>:2: FutureWarning: casting datetime64[ns] values to int64 with .astype(...) is deprecated and will raise in a future version. Use .view(...) instead.
  df["Data"] = df["Data"].astype("int64")

In [32]:
# Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [33]:
# Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [34]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [35]:
# Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [36]:
# Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [37]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda
92,Fortaleza,2019-01-01,3.49,1005,4,13.96,4.0,2019
26,Aracaju,2018-01-01,6.98,1521,10,69.80,10.0,2018
98,Natal,2019-01-02,231.76,1036,3,695.28,3.0,2019
228,Natal,2019-01-02,6.87,1037,3,20.61,3.0,2019
211,Salvador,2019-01-02,141.05,1035,3,423.15,3.0,2019

In [38]:
# Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [39]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda
110,Fortaleza,2019-03-02,51.98,983,6,311.88,6.0,2019,3,2
14,Recife,2019-01-12,102.91,982,3,308.73,3.0,2019,1,12
224,Salvador,2019-01-02,178.30,1035,3,534.90,3.0,2019,1,2
212,Natal,2019-01-02,50.73,1037,3,152.19,3.0,2019,1,2
110,Aracaju,2018-01-01,38.15,1520,4,152.60,4.0,2018,1,1

In [40]:
# Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [41]:
# Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [42]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias
95,Natal,2019-01-02,5.13,1035,1,5.13,1.0,2019,1,2,366 days
136,Natal,2019-01-02,13.81,1036,1,13.81,1.0,2019,1,2,366 days
126,Recife,2019-03-02,41.87,980,8,334.96,8.0,2019,3,2,425 days
8,Natal,2019-03-27,667.00,852,4,2668.00,4.0,2019,3,27,450 days
31,Aracaju,2018-01-01,171.16,1520,9,1540.44,9.0,2018,1,1,0 days

In [43]:
# Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [44]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
63,Natal,2018-02-12,552.00,852,2,1104.00,2.0,2018,2,12,42 days,1
40,Aracaju,2018-01-01,6.99,1522,7,48.93,7.0,2018,1,1,0 days,1
230,Salvador,2019-01-03,184.69,1036,1,184.69,1.0,2019,1,3,367 days,1
31,Fortaleza,2019-01-01,23.46,1002,4,93.84,4.0,2019,1,1,365 days,1
59,Natal,2018-01-15,369.00,853,2,738.00,2.0,2018,1,15,14 days,1

In [45]:
# Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[
    (df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)
]

In [48]:
vendas_marco_19.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
115,Fortaleza,2019-03-02,12.23,981,3,36.69,3.0,2019,3,2,425 days,1
116,Fortaleza,2019-03-02,79.10,982,2,158.20,2.0,2019,3,2,425 days,1
29,Natal,2019-03-09,646.00,854,2,1292.00,2.0,2019,3,9,432 days,1
75,Natal,2019-03-30,706.00,854,2,1412.00,2.0,2019,3,30,453 days,1
109,Salvador,2019-03-02,124.37,1035,1,124.37,1.0,2019,3,2,425 days,1